In [2]:
import pandas as pd

## Basic Methods and Attributes

In [3]:
# a dataframe is a basic data structure in python which stores data in tabular format
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns= ["A", "B", "C"], index = ['x', 'y', 'z'])

# print the whole data frame
print(df, '\n')

#print the first two rows 
print(df.head(2), '\n') 

#print last two rows
print(df.tail(2), '\n')

# by default the head and tail without parameters gives the first and last rows respectively

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

   A  B  C
x  1  2  3
y  4  5  6

   A  B  C
y  4  5  6
z  7  8  9

In [ ]:
# print the columns
print(df.columns)

# print the indices
print(list(df.index)) # the first column

Index(['A', 'B', 'C'], dtype='object')
['x', 'y', 'z']

In [21]:
# print the info about the dataframe 
print(df.info())

# print some other meaningful info
print(df.describe())

# print unique values
print(df.nunique())

# print the dimensions of the dataframe 
print(df.shape)

# print the number of elements in the dataframe
print(df.size)

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes
None
         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0
A    3
B    3
C    3
dtype: int64
(3, 3)
9

## Loading in DataFrames from files

In [6]:
education = pd.read_csv("datasets/International_Education_Costs.csv")

# apply the above operations
print("Head: \n", education.head(),'\n')
print("Tail: \n", education.tail())

Head:
      Country       City                      University  \
0        USA  Cambridge              Harvard University
1         UK     London         Imperial College London
2     Canada    Toronto           University of Toronto
3  Australia  Melbourne         University of Melbourne
4    Germany     Munich  Technical University of Munich

                  Program   Level  Duration_Years  Tuition_USD  \
0        Computer Science  Master             2.0        55400
1            Data Science  Master             1.0        41200
2      Business Analytics  Master             2.0        38500
3             Engineering  Master             2.0        42000
4  Mechanical Engineering  Master             2.0          500

   Living_Cost_Index  Rent_USD  Visa_Fee_USD  Insurance_USD  Exchange_Rate
0               83.5      2200           160           1500           1.00
1               75.8      1800           485            800           0.79
2               72.5      1600           235            900           1.35
3               71.2      1400           450            650           1.52
4               70.5      1100            75            550           0.92

Tail:
           Country        City                University               Program  \
902        France  Strasbourg  University of Strasbourg        Data Analytics
903      Malaysia       Nilai                      USIM      Computer Science
904  Saudi Arabia     Al-Ahsa    King Faisal University   Information Systems
905           USA     Seattle  University of Washington  Software Development
906            UK  Nottingham  University of Nottingham      Data Engineering

        Level  Duration_Years  Tuition_USD  Living_Cost_Index  Rent_USD  \
902    Master             2.0         4000               70.2      1000
903  Bachelor             3.0         6800               50.5       400
904    Master             2.0         4200               64.2       600
905       PhD             5.0        50000               77.8      2000
906    Master             2.0        34000               61.2       800

     Visa_Fee_USD  Insurance_USD  Exchange_Rate
902            99            850           0.92
903           120            400           4.65
904           200            800           3.75
905           160           1500           1.00
906           485            800           0.79

In [7]:
print(education.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 907 entries, 0 to 906
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Country            907 non-null    object
 1   City               907 non-null    object
 2   University         907 non-null    object
 3   Program            907 non-null    object
 4   Level              907 non-null    object
 5   Duration_Years     907 non-null    float64
 6   Tuition_USD        907 non-null    int64
 7   Living_Cost_Index  907 non-null    float64
 8   Rent_USD           907 non-null    int64
 9   Visa_Fee_USD       907 non-null    int64
 10  Insurance_USD      907 non-null    int64
 11  Exchange_Rate      907 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 85.2+ KB
None

In [8]:
print(education.describe())

       Duration_Years   Tuition_USD  Living_Cost_Index     Rent_USD  \
count      907.000000    907.000000         907.000000   907.000000
mean         2.836825  16705.016538          64.437486   969.206174
std          0.945449  16582.385275          14.056333   517.154752
min          1.000000      0.000000          27.800000   150.000000
25%          2.000000   2850.000000          56.300000   545.000000
50%          3.000000   7500.000000          67.500000   900.000000
75%          4.000000  31100.000000          72.200000  1300.000000
max          5.000000  62000.000000         122.400000  2500.000000

       Visa_Fee_USD  Insurance_USD  Exchange_Rate
count    907.000000     907.000000     907.000000
mean     211.396913     700.077178     623.000695
std      143.435740     320.374875    3801.746134
min       40.000000     200.000000       0.150000
25%      100.000000     450.000000       0.920000
50%      160.000000     650.000000       1.350000
75%      240.000000     800.000000       7.150000
max      490.000000    1500.000000   42150.000000

In [9]:
print(education.shape)
print(education.size)

print(list(education.columns))

(907, 12)
10884
['Country', 'City', 'University', 'Program', 'Level', 'Duration_Years', 'Tuition_USD', 'Living_Cost_Index', 'Rent_USD', 'Visa_Fee_USD', 'Insurance_USD', 'Exchange_Rate']

## Loading different types of files

---

### **CSV (Comma-Separated Values)**

* Stores tabular data in plain text format.
* Each line represents a row; columns are separated by commas.
* **Human-readable** and can be opened with text editors or Excel.
* Does **not** store data types or schema—everything is treated as text.
* **No compression** or indexing; results in **larger file sizes**.
* **Slower** to read/write, especially with large datasets.
* Still widely used due to its **simplicity and compatibility** across tools.

---

### **Feather**

* A **binary columnar format** optimized for fast data reading/writing.
* Part of the **Apache Arrow** ecosystem.
* Designed for **in-memory analytics**, especially with **Pandas** and **R**.
* **Preserves data types and schema**, unlike CSV.
* Supports **lightweight compression**.
* **Not human-readable**, but much faster and more space-efficient than CSV.
* Ideal for **medium-sized datasets** and fast data exchange between tools.

---

### **Parquet**

* A **highly efficient columnar storage format** developed by Apache.
* Best suited for **big data systems** like Spark, Hadoop, and cloud storage.
* Supports **compression**, **indexing**, and **complex nested data**.
* Retains detailed **schema and data types**.
* **Not human-readable**, but excellent for performance and scalability.
* Enables **fast access to specific columns**, improving query speed.
* Ideal for **large datasets**, data lakes, and distributed data processing.

---

In [10]:
bios = pd.read_csv("datasets/bios.csv") # csv file
bios.info()
bios.size

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

1455000

In [11]:
results = pd.read_parquet("datasets/results.parquet") # parquet file
results.info()
results.size

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

3392488

In [12]:
f_results = pd.read_feather("datasets/results.feather") # feather file
f_results.info()
f_results.size

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 308408 entries, 0 to 308407
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   year        305807 non-null  float64
 1   type        305807 non-null  object
 2   discipline  308407 non-null  object
 3   event       308408 non-null  object
 4   as          308408 non-null  object
 5   athlete_id  308408 non-null  int64
 6   noc         308407 non-null  object
 7   team        121714 non-null  object
 8   place       283193 non-null  float64
 9   tied        308408 non-null  bool
 10  medal       44139 non-null   object
dtypes: bool(1), float64(2), int64(1), object(7)
memory usage: 23.8+ MB

3392488

In [13]:
olympics = pd.read_excel("datasets/olympics-data.xlsx") # excel file
olympics.info()
olympics.size

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

1455000

In [14]:
# you can convert files from one to another 

parkayy = bios.to_parquet()

In [15]:
# use the display function to view the entire datset (displays the first 5 and last 5 rows)
display(bios)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [16]:
# access random rows using the sample function 
bios.sample(10, random_state=1) # setting random_state to True doesn't change the rows each time you run it

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
77995,78586,Will Hunter,1883-02-19,Louisville,Kentucky,USA,United States,NaN,NaN,1966-08-25
90491,91214,Melina Sirolli,1984-04-13,Buenos Aires,Ciudad Autónoma de Buenos Aires,ARG,Argentina,157.0,43.0,NaN
87794,88496,Yevgeny Smiryagin,1976-05-17,NaN,NaN,NaN,Russian Federation,185.0,77.0,NaN
41663,41982,Seppo Irjala,1937-12-02,Oulu,Pohjois-Pohjanmaa,FIN,Finland,173.0,70.0,2004-09-07
52117,52480,Kyoko Ishida,1960-07-12,Osaka,Osaka,JPN,Japan,177.0,65.0,NaN
94997,95765,Virgil Neagoe,1970-07-03,NaN,NaN,NaN,Romania,NaN,NaN,NaN
109156,110338,Aleksandr Smyshlyayev,1987-03-16,Lysva,Perm Kray,RUS,ROC Russian Federation,170.0,74.0,NaN
108894,110071,Yuichi Onda,1980-06-24,Myokokogen,Niigata,JPN,Japan,180.0,78.0,NaN
83405,84066,Franz Bernreiter,1954-02-13,NaN,NaN,NaN,West Germany,172.0,70.0,NaN
38056,38358,Vincenzo Di Palma,1970-06-30,Napoli,Napoli,ITA,Italy,165.0,53.0,NaN

In [17]:
# Indexing using loc and iloc 

# dataset.loc[] - Used to access rows and columns by their labels (names). (label based indexing)
# dataset.iloc[] - Used to access rows and columns by their integer positions (like a 2D array). (integer location based indexing)
# dataset.loc[[rows],[columns]]
bios.loc[0] # returns the first row

bios.loc[[0,1,2]] # returns the first 3 rows
bios.loc[[23,47,89]] # returns the 23rd, 47th and 89th rows 

# you can do indexing too 
bios.loc[5:10]

# specify column name with row slice
bios.loc[5:8, ["name", "born_date"]]

                name   born_date
5  Nicolas Chatelain  1970-01-13
6      Patrick Chila  1969-11-27
7       Henri Cochet  1901-12-14
8      Marcel Cousin  1896-08-04

In [18]:
# bios.loc[35450:35455, "height"] = 172.5
bios.loc[35450:35455, ['name', 'height']]

KeyError: "['height'] not in index"

In [22]:
# Acessing objects at specific index using at and iat 

print(bios.at[45678, 'name'])
print(bios.iat[45678, 1])

Dave Shemilt
Dave Shemilt

In [23]:
coffee = pd.read_csv('datasets/coffee.csv')
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
# sorting

coffee.sort_values(["Units Sold"])


# sort in descending order, add more parameters for the sort
coffee.sort_values(["Units Sold", 'Coffee Type'], ascending = False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [25]:
# iterating through rows using a for loops 

for index, row in coffee.iterrows(): 
    print(index)
    print(row['Units Sold'],'\n') # you can grab a specific row

for index, row in coffee.iterrows(): 
    print(index, row)

0
25

1
15

2
30

3
20

4
35

5
25

6
40

7
30

8
45

9
35

10
45

11
35

12
45

13
35

0 Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object
1 Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object
2 Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object
3 Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object
4 Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object
5 Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
6 Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
7 Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
8 Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
9 Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
10 Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
11 Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
12 Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object
13 Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object